planets_app/app/controllers/planets_controller.rb

    def show
        @planet = Planet.find(params[:id])
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def random
        @planet = Planet.find(rand(8))
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]