app/controllers/moons_controller.rb

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "moons".* FROM "moons" WHERE "moons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @planet = Planet.find(params[:planet_id])
        @moon = Moon.find(params[:id])